{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files in the project.",
  "frontend/index.css": "Tailwind base, component, and utility layers with color variables and global theming for light and dark modes.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the app through main.tsx.",
  "frontend/src/App.tsx": "Root React component centering the ValentinePrompt UI on the page.",
  "frontend/src/components/CelebrationPhoto.tsx": "Image component with load/error handling, state reset on src change, and fade‑in behavior.",
  "frontend/src/components/FullscreenCelebrationViewer.tsx": "Empty file placeholder for the fullscreen celebration viewer component.",
  "frontend/src/components/InlineCelebration.tsx": "Inline celebration view rendering floating hearts, two photos via getAssetUrl, and themed celebration text.",
  "frontend/src/components/ValentinePrompt.tsx": "Interactive prompt with evasive No button logic and conditional rendering of the inline celebration state.",
  "frontend/src/hooks/useActor.ts": "Hook creating or retrieving a backend actor tied to Internet Identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, persistence, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, base typography, and custom romantic-themed utility classes with animations and gradients.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context, then renders the main App component.",
  "frontend/src/utils/assetUrl.ts": "Provides a helper to build base-path-aware asset URLs for Vite deployments.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, and plugins for a romantic-themed UI palette.",
  "project_state.json": "Stores project metadata, requirements, issues, and architectural notes for the Valentine webpage implementation."
}